# Dataframe manipulation

In [1]:
import pandas as pd

## Q1 
아래 DataFrame을 활용해 남성과 여성 각각 Age가 30이상인 사람들의 평균 Height을 구해보자.

In [5]:
data_frame = pd.DataFrame({
    'Age': [37, 20, 30, 45, 25, 31, 41],
    'Height' : [156, 180, 170, 160, 150, 140, 181],
    'Sex' : ['f','m','m','f','f','f','m']
})
data_frame

   Age  Height Sex
0   37     156   f
1   20     180   m
2   30     170   m
3   45     160   f
4   25     150   f
5   31     140   f
6   41     181   m

## Q2
프로듀스 회사의 근무자, 성별, 근무지, 연봉이 기록된 “Produce.xlsx”에서 다음과 같은 질문에 답해보도록 하자.
1) 이름이 김사랑, 성별 F, 근무지 CICAGO, 연봉 6000인 직원을 추가하라.  
2) 성별이 M이면 1, 성별이 F이면 0인 Sex 열을 추가하고, 성별 열을 제거하라.  
3) 근무지별, 성별 평균 연봉을 구하여라.(다음과 같이 출력되도록 하여라)  
4) 성별이 M이고 SEOUL에서 일하는 사람들의 평균 연봉을 구하여라.  
5) 연봉이 5000이상인 사람들 중 여성의 비율을 구하여라.

In [11]:
prod = pd.read_excel('./Produce.xlsx')
prod

        이름 성별     근무지  연봉(만원)
0     강다니엘  M   SEOUL    5419
1      강동호  M  CICAGO    6443
2      강미나  F   SEOUL     445
3      권현빈  M      LA    1199
4      김도연  F  CICAGO    7579
5     김사무엘  M   SEOUL     290
6      김세정  F  CICAGO    4113
7      김소혜  F   SEOUL    1200
8      김청하  F   SEOUL    5447
9      노태현  M  CICAGO    3126
10    라이관린  M      LA    6890
11     박우진  M      LA    2371
12     박지훈  M   SEOUL    7980
13     배진영  M  CICAGO    8399
14     옹성우  M   SEOUL    2477
15     유연정  F   SEOUL    8474
16     임나영  F   SEOUL    6732
17     전소미  F      LA    9828
18     정채연  F   SEOUL    2208
19     주결경  F   SEOUL    7373
20     주학년  M  CICAGO    1379
21     최유정  F      LA    7137
22  타카다 켄타  M      LA    4091
23     하성운  M  CICAGO    8721